const DataQA = [
    {
        id: 1,
        title: "ما هي أهم أعمال الشيخ الألباني رحمه الله تعالى؟",
        question: "إذا وجدت حديثًا في النّسائي وأردت أن أرى ماذا صنّفه الألباني، كيف يمكنني أن أجد تصنيفه؟ ما اسم كتبه التي تحتوي على كل درجات الحديث؟ هل صنّف الألباني كتبا في الحكم على السنّن الأربعة (النسائيّ، الترمذي، أبو داود، وابن ماجة)؟ ",
        response: "مشروع الألباني هو تسهيل الانتفاع بدواوين السنة للناس"
    },
    {
        id: 2,
        title: "ما معنى (أو) في قوله تعالى: (وأرسلناه إلى مائة ألف أو يزيدون)؟",
        question: "ماهو المعنى الحقيقي لحرف ( أو ) في قوله تعالى (وأرسلناه إلى مائة ألف أو يزيدون) لأن الله عز و جل علام الغيوب، ولا يعجزه أن يذكر العدد الإجمالي؟",
        response: "إن (أو): في كلام الله جل جلاله لا تدل على الشك، فالشك لا مدخل له في خبر علام الغيوب.  واختلف العلماء في معنى (أو) في قوله تعالى: {وَأَرْسَلْنَاهُ إِلَى مِائَةِ أَلْفٍ أَوْ يَزِيدُونَ} [الصَّافَّاتِ: 147]، بعد اتفاقهم أنَّها ليست للشك. وينظر تفصيل هذه الأقوال في الجواب المطول"
    },
    {
        id: 3,
        title: "كيفية صلاة الاستخارة وشرح دعائها",
        question: "كيفية صلاة الاستخارة وشرح دعائهاكيف تكون صلاة الاستخارة ؟ وماهو الدعاء الذي يقال فيها ؟.",
        response: ""
    },
    {
        id: 4,
        title: "ما هي أركان الصلاة وواجباتها وسننها؟",
        question: "ما المقصود بسنن  الصلاة؟ وما هي أركان الصلاة؟ وما هي واجباتها ؟ وما الفرق بين الركن والواجب؟",
        response: "أركان الصلاة أربعة عشر ركناً، وواجباتها ثمانية. وسنن الصلاة كثيرة منها القولية والفعلية، والفرق بين الركن والواجب أن الركن لا يسقط عمدا ولا سهوا، بل لابد من الإتيان به، أما الواجب فيسقط بالنسيان، ويجبر بسجود السهو. وينظر الجواب المفصل أدناه."
    },
    {
        id: 5,
        title: "ما هي أسباب نقصان الإيمان",
        question: "ما هي أسباب نقصان الإيمان ؟.",
        response: ""
    },
    {
        id: 6,
        title: "أركان الإيمان وشعب الإيمان",
        question: "كيف نجمع بين أن الإيمان هو (الإيمان بالله وملائكته وكتبه واليوم الآخر, وبالقدر خيره وشره) وقول النبي صلى الله عليه وسلم : (الإيمان بضع وسبعون شعبة ...إلخ) ؟.",
        response: ""
    },
    {
        id: 7,
        title: "عدد ركعات صلاة الضحى",
        question: "كم ركعة صلاة الضحى ؟ لقد سمعت أن أقلها ركعتان وأكثرها ثمان ركعات ، فما الدليل ؟ وهل تُصلى مثنى مثنى ؟",
        response: ""
    },
    {
        id: 8,
        title: "عدد ركعات صلاة الضحى",
        question: "كم ركعة صلاة الضحى ؟ لقد سمعت أن أقلها ركعتان وأكثرها ثمان ركعات ، فما الدليل ؟ وهل تُصلى مثنى مثنى ؟",
        response: ""
    },
  ]
  
  export default DataQA